vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKE17Z7_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MKE17Z7_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MKE17Z7</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
    <release version="25.06.00" date="2025-06-24">NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
    <release version="25.03.00" date="2025-03-28">NXP CMSIS Packs based on MCUXpresso SDK 25.03.00</release>
    <release version="19.0.0" date="2024-07-17">NXP CMSIS Packs based on MCUXpresso SDK 2.16.0</release>
    <release version="18.0.0" date="2024-01-14">NXP CMSIS Packs based on MCUXpresso SDK 2.15.0</release>
    <release version="17.0.0" date="2023-07-27">NXP CMSIS Packs based on MCUXpresso SDK 2.14.0</release>
    <release version="16.0.0" date="2023-01-16">NXP CMSIS Packs based on MCUXpresso SDK 2.13.0</release>
    <release version="15.0.0" date="2022-07-13">NXP CMSIS Packs based on MCUXpresso SDK 2.12.0</release>
    <release version="14.0.0" date="2022-01-05">NXP CMSIS Packs based on MCUXpresso SDK 2.11.0</release>
    <release version="13.0.0" date="2021-08-23">NXP CMSIS Packs based on MCUXpresso SDK 2.10.1</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MKE17Z7" Dvendor="NXP:11">
      <description>
        Kinetis KE1xZ-72 MHz, Mainstream with Touch Interface 5V Microcontrollers based on ARM Cortex-M0+
      </description>
      <device Dname="MKE17Z256xxx7">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="72000000"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/MKE17Z7/iar/MKE17Z256xxx7_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x040000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1fffc000" size="0xc000" access="rw" default="1"/>
        <algorithm name="devices/MKE17Z7/arm/MKE1x_P256_2KB_SEC.FLM" start="0x00000000" size="0x00040000" RAMstart="0x1fffc000" RAMsize="0x00001000" default="1"/>
        <debug svd="devices/MKE17Z7/MKE17Z7.xml"/>
        <variant Dvariant="MKE17Z256VLL7">
          <compile header="devices/MKE17Z7/fsl_device_registers.h" define="CPU_MKE17Z256VLL7"/>
        </variant>
        <variant Dvariant="MKE17Z256VLH7">
          <compile header="devices/MKE17Z7/fsl_device_registers.h" define="CPU_MKE17Z256VLH7"/>
        </variant>
        <variant Dvariant="MKE17Z256VLF7">
          <compile header="devices/MKE17Z7/fsl_device_registers.h" define="CPU_MKE17Z256VLF7"/>
        </variant>
      </device>
      <device Dname="MKE17Z128xxx7">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="72000000"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/MKE17Z7/iar/MKE17Z128xxx7_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x020000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1fffe000" size="0x8000" access="rw" default="1"/>
        <algorithm name="devices/MKE17Z7/arm/MKE1x_P256_2KB_SEC.FLM" start="0x00000000" size="0x00020000" RAMstart="0x1fffe000" RAMsize="0x00001000" default="1"/>
        <debug svd="devices/MKE17Z7/MKE17Z7.xml"/>
        <variant Dvariant="MKE17Z128VLL7">
          <compile header="devices/MKE17Z7/fsl_device_registers.h" define="CPU_MKE17Z128VLL7"/>
        </variant>
        <variant Dvariant="MKE17Z128VLH7">
          <compile header="devices/MKE17Z7/fsl_device_registers.h" define="CPU_MKE17Z128VLH7"/>
        </variant>
        <variant Dvariant="MKE17Z128VLF7">
          <compile header="devices/MKE17Z7/fsl_device_registers.h" define="CPU_MKE17Z128VLF7"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MKE17Z7.internal_condition">
      <accept Dname="MKE17Z256VLF7" Dvendor="NXP:11"/>
      <accept Dname="MKE17Z256VLH7" Dvendor="NXP:11"/>
      <accept Dname="MKE17Z256VLL7" Dvendor="NXP:11"/>
      <accept Dname="MKE17Z128VLF7" Dvendor="NXP:11"/>
      <accept Dname="MKE17Z128VLH7" Dvendor="NXP:11"/>
      <accept Dname="MKE17Z128VLL7" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MKE17Z7.internal_condition"/>
    </condition>
    <condition id="allOf.device=MKE17Z7.internal_condition">
      <require condition="device.MKE17Z7.internal_condition"/>
    </condition>
    <condition id="component.cmsis_drivers.condition_id">
      <require condition="allOf.device=MKE17Z7.internal_condition"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=MKE17Z7.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=MKE17Z7.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MKE17Z7.internal_condition"/>
    </condition>
    <condition id="component.log.condition_id">
      <require condition="allOf.driver.common, utility.str, device=MKE17Z7.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.str, device=MKE17Z7.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MKE17Z7.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console, device=MKE17Z7.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, utility.debug_console, device=MKE17Z7.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MKE17Z7.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console_lite.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console_lite, device=MKE17Z7.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, utility.debug_console_lite, device=MKE17Z7.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.MKE17Z7.internal_condition"/>
    </condition>
    <condition id="component.log.backend.ringbuffer.condition_id">
      <require condition="allOf.component.log, driver.common, device=MKE17Z7.internal_condition"/>
    </condition>
