vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKE17Z7_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MKE17Z7_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MKE17Z7_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MKE17Z128xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z7/arm/MKE17Z128xxx7_flash.scf" version="1.0.0" projectpath="MKE17Z7/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MKE17Z128xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z7/arm/MKE17Z128xxx7_ram.scf" version="1.0.0" projectpath="MKE17Z7/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MKE17Z256xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z7/arm/MKE17Z256xxx7_flash.scf" version="1.0.0" projectpath="MKE17Z7/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MKE17Z256xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z7/arm/MKE17Z256xxx7_ram.scf" version="1.0.0" projectpath="MKE17Z7/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MKE17Z128xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z7/gcc/MKE17Z128xxx7_flash.ld" version="1.0.0" projectpath="MKE17Z7/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MKE17Z128xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z7/gcc/MKE17Z128xxx7_ram.ld" version="1.0.0" projectpath="MKE17Z7/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MKE17Z256xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z7/gcc/MKE17Z256xxx7_flash.ld" version="1.0.0" projectpath="MKE17Z7/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MKE17Z256xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z7/gcc/MKE17Z256xxx7_ram.ld" version="1.0.0" projectpath="MKE17Z7/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MKE17Z128xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z7/iar/MKE17Z128xxx7_flash.icf" version="1.0.0" projectpath="MKE17Z7/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MKE17Z128xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z7/iar/MKE17Z128xxx7_ram.icf" version="1.0.0" projectpath="MKE17Z7/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MKE17Z256xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z7/iar/MKE17Z256xxx7_flash.icf" version="1.0.0" projectpath="MKE17Z7/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MKE17Z256xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z7/iar/MKE17Z256xxx7_ram.icf" version="1.0.0" projectpath="MKE17Z7/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MKE17Z7" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MKE17Z7</description>
      <files>
        <file category="header" attr="config" name="devices/MKE17Z7/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE17Z7/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MKE17Z7/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE17Z7/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MKE17Z7/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE17Z7/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MKE17Z7/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE17Z7/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MKE17Z7/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MKE17Z7_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MKE17Z7/iar/startup_MKE17Z7.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MKE17Z7/gcc/startup_MKE17Z7.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MKE17Z7/arm/startup_MKE17Z7.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MKE17Z7_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MKE17Z7_system</description>
      <files>
        <file category="sourceC" name="devices/MKE17Z7/system_MKE17Z7.c" projectpath="device"/>
        <file category="header" name="devices/MKE17Z7/system_MKE17Z7.h" projectpath="device"/>
        <file category="include" name="devices/MKE17Z7/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acmp" Cversion="2.3.0" condition="driver.acmp.condition_id">
      <description>ACMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE17Z7/drivers/fsl_acmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z7/drivers/fsl_acmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z7/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.0.8" condition="driver.adc12.condition_id">
      <description>ADC12 Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE17Z7/drivers/fsl_adc12.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z7/drivers/fsl_adc12.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z7/drivers/"/>
      </files>
    </component>
